soap_payload_schedule_report_01.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/oxp/service/v2">
	<soapenv:Header/>
	<soapenv:Body>
		<v2:scheduleReport>
			<v2:scheduleRequest>
				<v2:bookBindingOutputOption>false</v2:bookBindingOutputOption>
				<v2:deliveryChannels>
					<v2:wccOptions>
						<v2:item>
							<v2:WCCFileName>JJMR_03.xml</v2:WCCFileName>
							<v2:WCCFolderPath>/Contribution Folders/CRM</v2:WCCFolderPath>
							<v2:WCCSecurityGroup>CRMStage</v2:WCCSecurityGroup>
							<v2:WCCServerName>FA_UCM_PROVISIONED</v2:WCCServerName>
							<v2:WCCTitle>JJMR_03</v2:WCCTitle>
						</v2:item>
					</v2:wccOptions>
				</v2:deliveryChannels>
				<v2:reportRequest>
					<v2:attributeFormat>HTML</v2:attributeFormat>
					<v2:attributeLocale>en-US</v2:attributeLocale>
					<v2:attributeTemplate>XX_FLEX_DATA</v2:attributeTemplate>
					<v2:reportAbsolutePath>/Custom/DEMO_OIC/XX_FLEX_DATA_REP.xdo</v2:reportAbsolutePath>
					<v2:sizeOfDataChunkDownload>-1</v2:sizeOfDataChunkDownload>
					<v2:parameterNameValues>
						<v2:listOfParamNameValues>
							<v2:item>
								<v2:name>P_EXT_SOURCE</v2:name>
								<v2:values>
									<v2:item>DEMO1</v2:item>
								</v2:values>
							</v2:item>
						</v2:listOfParamNameValues>
					</v2:parameterNameValues>
				</v2:reportRequest>
				<v2:notifyWhenFailed>true</v2:notifyWhenFailed>
				<v2:notifyWhenSuccess>true</v2:notifyWhenSuccess>
				<v2:notifyWhenWarning>true</v2:notifyWhenWarning>
				<v2:saveDataOption>true</v2:saveDataOption>
				<v2:saveOutputOption>true</v2:saveOutputOption>
				<v2:scheduleBurstringOption>false</v2:scheduleBurstringOption>
				<v2:schedulePublicOption>true</v2:schedulePublicOption>
				<v2:startDate>SYSDATE</v2:startDate>
				<v2:userJobName>JJMR_WS_Test</v2:userJobName>
			</v2:scheduleRequest>
			<v2:userID>fin_impl</v2:userID>
			<v2:password>wm#qK8*9</v2:password>
		</v2:scheduleReport>
	</soapenv:Body>
</soapenv:Envelope>
